DIVS = ["서울", "부산", "대구", "인천", "광주", "대전", "울산", "세종", "경기", "강원", "충청",
    "충북", "충남", "전라", "전북", "전남", "경상", "경북", "경남", "제주"]

GUS = ['종로', '중구', '용산', '성동', '광진', '동대문', '중랑', '성북', '강북', '도봉', '노원', '은평', '서대문', '마포', '양천', '강서', '구로', '금천', '영등포', '동작', '관악', '서초', '강남', '송파', '강동', '서구', '동구', '영도', '부산진', '동래', '남구', '북구', '강서', '해운대', '사하', '금정', '연제', '수영', '사상', '기장', '수성', '달서', '달성', '미추홀', '연수', '남동', '부평', '계양', '강화', '옹진', '광산', '유성', '대덕', '울주', '수원', '장안', '권선', '팔달', '영통', '성남', '수정', '중원', '분당', '의정부', '안양', '만안', '동안', '부천', '광명', '동두천', '평택', '안산', '상록', '단원', '고양', '덕양', '일산동', '일산서', '과천', '구리', '남양주', '오산', '시흥', '군포', '의왕', '하남', '용인', '처인', '기흥', '수지', '파주', '이천', '안성', '김포', '화성', '광주', '양주', '포천', '여주', '연천', '가평', '양평', '춘천', '원주', '강릉', '동해', '태백', '속초', '삼척', '홍천', '횡성', '영월', '평창', '정선', '철원', '화천', '양구', '인제', '고성', '양양', '청주', '상당', '흥덕', '서원', '청원', '충주', '제천', '보은', '옥천', '영동', '증평', '진천', '괴산', '음성', '단양', '천안', '동남', '서북', '공주', '보령', '아산', '서산', '논산', '계룡', '당진', '금산', '부여', '서천', '청양', '홍성', '예산', '태안', '전주', '완산', '덕진', '군산', '익산', '정읍', '남원', '김제', '완주', '진안', '무주', '장수', '임실', '순창', '고창', '부안', '목포', '여수', '순천', '나주', '광양', '담양', '곡성', '구례', '고흥', '보성', '화순', '장흥', '강진', '해남', '영암', '무안', '함평', '영광', '장성', '완도', '진도', '신안', '항시', '경주', '김천', '안동', '구미', '영주', '영천', '상주', '문경', '경산', '군위', '의성', '청송', '영양', '영덕', '청도', '고령', '성주', '칠곡', '예천', '봉화', '울진', '울릉', '창원', '의창', '성산', '마산합포', '마산회원', '진해', '진주', '통영', '사천', '김해', '밀양', '거제', '양산', '의령', '함안', '창녕', '고성', '남해', '하동', '산청', '함양', '거창', '합천', '제주', '서귀포', '마산', '부천', '조치원', '일산']

# gus_basic = ["종로구", "중구", "용산구", "성동구", "광진구", "동대문구", "중랑구", "성북구", "강북구", "도봉구",
#     "노원구", "은평구", "서대문구", "마포구", "양천구", "강서구", "구로구", "금천구", "영등포구", "동작구",
#     "관악구", "서초구", "강남구", "송파구", "강동구",
#     "중구", "서구", "동구", "영도구", "부산진구", "동래구", "남구", "북구", "강서구", "해운대구",
#     "사하구", "금정구", "연제구", "수영구", "사상구", "기장군", "중구", "동구", "서구", "남구",
#     "북구", "수성구", "달서구", "달성군", "중구", "동구", "미추홀구", "연수구", "남동구", "부평구",
#     "계양구", "서구", "강화군", "옹진군", "동구", "서구", "남구", "북구", "광산구", "동구", "중구",
#     "서구", "유성구", "대덕구", "중구", "남구", "동구", "북구", "울주군", "수원시", "장안구", "권선구",
#     "팔달구", "영통구", "성남시", "수정구", "중원구", "분당구", "의정부시", "안양시", "만안구", "동안구",
#     "부천시", "광명시", "동두천시", "평택시", "안산시", "상록구", "단원구", "고양시", "덕양구", "일산동구",
#     "일산서구", "과천시", "구리시", "남양주시", "오산시", "시흥시", "군포시", "의왕시", "하남시", "용인시",
#     "처인구", "기흥구", "수지구", "파주시", "이천시", "안성시", "김포시", "화성시", "광주시", "양주시",
#     "포천시", "여주시", "연천군", "가평군", "양평군", "춘천시", "원주시", "강릉시", "동해시", "태백시",
#     "속초시", "삼척시", "홍천군", "횡성군", "영월군", "평창군", "정선군", "철원군", "화천군", "양구군",
#     "인제군", "고성군", "양양군", "청주시", "상당구", "흥덕구", "서원구", "청원구", "충주시", "제천시",
#     "보은군", "옥천군", "영동군", "증평군", "진천군", "괴산군", "음성군", "단양군", "천안시", "동남구",
#     "서북구", "공주시", "보령시", "아산시", "서산시", "논산시", "계룡시", "당진시", "금산군", "부여군",
#     "서천군", "청양군", "홍성군", "예산군", "태안군", "전주시", "완산구", "덕진구", "군산시", "익산시",
#     "정읍시", "남원시", "김제시", "완주군", "진안군", "무주군", "장수군", "임실군", "순창군", "고창군",
#     "부안군", "목포시", "여수시", "순천시", "나주시", "광양시", "담양군", "곡성군", "구례군", "고흥군",
#     "보성군", "화순군", "장흥군", "강진군", "해남군", "영암군", "무안군", "함평군", "영광군", "장성군",
#     "완도군", "진도군", "신안군", "항시", "남구", "북구", "경주시", "김천시", "안동시", "구미시", "영주시",
#     "영천시", "상주시", "문경시", "경산시", "군위군", "의성군", "청송군", "영양군", "영덕군", "청도군",
#     "고령군", "성주군", "칠곡군", "예천군", "봉화군", "울진군", "울릉군", "창원시", "의창구", "성산구",
#     "마산합포구", "마산회원구", "진해구", "진주시", "통영시", "사천시", "김해시", "밀양시", "거제시",
#     "양산시", "의령군", "함안군", "창녕군", "고성군", "남해군", "하동군", "산청군", "함양군", "거창군",
#     "합천군", "제주시", "서귀포시"]
# gus_manual = ["마산", "부천", "조치원", "일산"]
# gus_sort = []
# for gu in gus_basic:
#     if gu not in gus_sort:
#         if len(gu) > 2:
#             gu = gu[:-1]
#         gus_sort.append(gu)
# gus = gus_sort + gus_manual
